#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```terraform

Running plan in HCP Terraform. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/FIAP-Lanchonete-G41/tech-challenge-fase-3-iac/runs/run-zHv8c7NfXPVY6D2E

Waiting for the plan to start...

Terraform v1.10.2
on linux_amd64
Initializing plugins and modules...
module.db_password_secret.aws_secretsmanager_secret.this: Refreshing state... [id=arn:aws:secretsmanager:us-east-1:721525683170:secret:db-password-wAVJzr]
module.lanchonete_vpc.aws_vpc.this: Refreshing state... [id=vpc-01ccebb8e1173efa6]
data.aws_iam_role.lab_role: Refreshing...
module.lanchonete_http_api.aws_apigatewayv2_api.this: Refreshing state... [id=yvq96tymqj]
data.aws_iam_role.lab_role: Refresh complete after 1s [id=LabRole]
module.db_password_secret.aws_secretsmanager_secret_version.this: Refreshing state... [id=arn:aws:secretsmanager:us-east-1:721525683170:secret:db-password-wAVJzr|terraform-20241215204947233100000002]
module.lanchonete_http_api.aws_apigatewayv2_stage.this: Refreshing state... [id=$default]
module.lanchonete_rds_sg.aws_security_group.this: Refreshing state... [id=sg-078fb7125dda17dc5]
module.lanchonete_db_private_subnet_b.aws_subnet.this: Refreshing state... [id=subnet-066ded97972d280f4]
module.lanchonete_db_private_subnet_a.aws_subnet.this: Refreshing state... [id=subnet-0a18b603050194fdf]
module.lanchonete_rds.aws_db_subnet_group.this: Refreshing state... [id=lanchonete-subnet-group]
module.lanchonete_rds.aws_db_instance.this: Refreshing state... [id=db-CDPODJYGLX2RS2BVFH3BIF4FPM]
module.lanchonete_http_api.aws_apigatewayv2_api.this: Drift detected (update)
module.lanchonete_http_api.aws_apigatewayv2_stage.this: Drift detected (update)

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.lanchonete_eks_cluster.aws_eks_cluster.this will be created
  + resource "aws_eks_cluster" "this" {
      + arn                           = (known after apply)
      + bootstrap_self_managed_addons = true
      + certificate_authority         = (known after apply)
      + cluster_id                    = (known after apply)
      + created_at                    = (known after apply)
      + endpoint                      = (known after apply)
      + id                            = (known after apply)
      + identity                      = (known after apply)
      + name                          = "lanchonete-eks-cluster"
      + platform_version              = (known after apply)
      + role_arn                      = "arn:aws:iam::721525683170:role/LabRole"
      + status                        = (known after apply)
      + tags_all                      = (known after apply)
      + version                       = (known after apply)

      + access_config {
          + authentication_mode = "API_AND_CONFIG_MAP"
        }

      + kubernetes_network_config (known after apply)

      + upgrade_policy (known after apply)

      + vpc_config {
          + cluster_security_group_id = (known after apply)
          + endpoint_private_access   = false
          + endpoint_public_access    = true
          + public_access_cidrs       = (known after apply)
          + security_group_ids        = [
              + "sg-078fb7125dda17dc5",
            ]
          + subnet_ids                = (known after apply)
          + vpc_id                    = (known after apply)
        }
    }

  # module.lanchonete_eks_node_group.aws_eks_node_group.this will be created
  + resource "aws_eks_node_group" "this" {
      + ami_type               = (known after apply)
      + arn                    = (known after apply)
      + capacity_type          = (known after apply)
      + cluster_name           = "lanchonete-eks-cluster"
      + disk_size              = (known after apply)
      + id                     = (known after apply)
      + instance_types         = (known after apply)
      + node_group_name        = "lanchonete-eks-node-group"
      + node_group_name_prefix = (known after apply)
      + node_role_arn          = "arn:aws:iam::721525683170:role/LabRole"
      + release_version        = (known after apply)
      + resources              = (known after apply)
      + status                 = (known after apply)
      + subnet_ids             = (known after apply)
      + tags                   = {
          + "Provisioner" = "Terraform"
        }
      + tags_all               = {
          + "Provisioner" = "Terraform"
        }
      + version                = (known after apply)

      + scaling_config {
          + desired_size = 1
          + max_size     = 2
          + min_size     = 1
        }

      + update_config (known after apply)
    }

  # module.lanchonete_eks_private_subnet_a.aws_subnet.this will be created
  + resource "aws_subnet" "this" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "us-east-1a"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.0.2.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Name"        = "lanchonete-eks-private-subnet-a"
          + "Provisioner" = "Terraform"
        }
      + tags_all                                       = {
          + "Name"        = "lanchonete-eks-private-subnet-a"
          + "Provisioner" = "Terraform"
        }
      + vpc_id                                         = "vpc-01ccebb8e1173efa6"
    }

  # module.lanchonete_eks_private_subnet_b.aws_subnet.this will be created
  + resource "aws_subnet" "this" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "us-east-1b"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.0.3.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Name"        = "lanchonete-eks-private-subnet-b"
          + "Provisioner" = "Terraform"
        }
      + tags_all                                       = {
          + "Name"        = "lanchonete-eks-private-subnet-b"
          + "Provisioner" = "Terraform"
        }
      + vpc_id                                         = "vpc-01ccebb8e1173efa6"
    }

Plan: 4 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pushed by: @rafaelvmasc, Action: `pull_request`*